# CreateSubRegionFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SubRegionFailures..::..CreateSubRegionFailed Property
BuiltInFailures..::..SubRegionFailures Class See Also
---
Create sub-division failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CreateSubRegionFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CreateSubRegionFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CreateSubRegionFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SubRegionFailures Class
Autodesk.Revit.DB Namespace